vedderb/nrf52_vesc/main.c
#ifdef NRF52840_XXAA
#define UART_TX_BUF_SIZE                16384
#define UART_RX_BUF_SIZE                16384
#else
#define UART_TX_BUF_SIZE                2048
#define UART_RX_BUF_SIZE                8192
#endif

#define PACKET_VESC						0
#define PACKET_BLE						1

#define LED_ON()						nrf_gpio_pin_set(LED_PIN)
#define LED_OFF()						nrf_gpio_pin_clear(LED_PIN)


#ifdef NRF52840_XXAA

#if MODULE_XIAO_BLE
#define UART_RX							NRF_GPIO_PIN_MAP(1, 12) //P1.12
#define UART_TX							NRF_GPIO_PIN_MAP(1, 11) //P1.11
#define UART_TX_DISABLED				2
#define LED_PIN							NRF_GPIO_PIN_MAP(0, 30) //Green LED, P0.30
								//NRF_GPIO_PIN_MAP(0, 6) //Blue LED, P0.06
								//NRF_GPIO_PIN_MAP(0, 26) //Red LED, P0.26
#elif MODULE_BUILTIN
#define UART_RX							26
#define UART_TX							25
#define UART_TX_DISABLED				28
#define LED_PIN						27

#elif MODULE_RD2
#define UART_RX							11
#define UART_TX							12
#define UART_TX_DISABLED				18
#define LED_PIN							15

#elif MODULE_STORMCORE
#define UART_RX							31
#define UART_TX							30
#define UART_TX_DISABLED				29
#define LED_PIN							5

#elif MODULE_RD_BMS
#define UART_RX							4
#define UART_TX							5
#define UART_TX_DISABLED				2
#define LED_PIN							NRF_GPIO_PIN_MAP(1, 5)
#undef LED_ON
#undef LED_OFF
#define LED_ON()						nrf_gpio_pin_set(NRF_GPIO_PIN_MAP(1, 1)); nrf_gpio_pin_clear(LED_PIN)
#define LED_OFF()						nrf_gpio_pin_set(LED_PIN)

#else
#define UART_RX							11
#define UART_TX							8
#define UART_TX_DISABLED				25
#define LED_PIN							7
#endif

#else
#if MODULE_BUILTIN
#define UART_RX							6
#define UART_TX							7
#define UART_TX_DISABLED				25
#define EN_DEFAULT						1
#define LED_PIN							8
#define LED_PIN2_INV					5

#else
#define UART_RX							7
#define UART_TX							6
#define UART_TX_DISABLED				25
#define EN_DEFAULT						1
#define LED_PIN							8
#endif
#endif

// Alternative inverted LED pin
#ifdef LED_PIN2_INV
#undef LED_ON
#undef LED_OFF
#define LED_ON()						nrf_gpio_pin_set(LED_PIN); nrf_gpio_pin_clear(LED_PIN2_INV)
#define LED_OFF()						nrf_gpio_pin_clear(LED_PIN); nrf_gpio_pin_set(LED_PIN2_INV)
#endif

// Private variables
APP_TIMER_DEF(m_packet_timer);
APP_TIMER_DEF(m_nrf_timer);

BLE_NUS_DEF(m_nus, NRF_SDH_BLE_TOTAL_LINK_COUNT);                                   /**< BLE NUS service instance. */
NRF_BLE_GATT_DEF(m_gatt);                                                           /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                             /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising);                                                 /**< Advertising module instance. */

static uint16_t   m_conn_handle          = BLE_CONN_HANDLE_INVALID;                 /**< Handle of the current connection. */
static uint16_t   m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3;            /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */
static ble_uuid_t m_adv_uuids[]          =                                          /**< Universally unique service identifier. */
{
		{BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}
};

static volatile bool m_is_enabled = true;
static volatile bool m_uart_error = false;
static volatile int m_other_comm_disable_time = 0;
static volatile int m_no_sleep_cnt = 0;
static volatile int m_disconnect_cnt = 0;
static volatile int m_reset_timer = 0;

app_uart_comm_params_t m_uart_comm_params =
{
		.rx_pin_no    = UART_RX,
		.tx_pin_no    = UART_TX,
		.rts_pin_no   = 0,
		.cts_pin_no   = 0,
		.flow_control = APP_UART_FLOW_CONTROL_DISABLED,
		.use_parity   = false,
#if defined (UART_PRESENT)
		.baud_rate    = NRF_UART_BAUDRATE_115200
#else
		.baud_rate    = NRF_UARTE_BAUDRATE_115200
#endif
};

// Functions
void ble_printf(const char* format, ...);
static void set_enabled(bool en);
static void start_advertising(void);
#if USE_SLEEP
static void go_to_sleep(void);
#endif

#if defined(NRF52840_XXAA) && USE_USB
static void cdc_acm_user_ev_handler(app_usbd_class_inst_t const * p_inst,
		app_usbd_cdc_acm_user_event_t event);

#define CDC_ACM_COMM_INTERFACE  0
#define CDC_ACM_COMM_EPIN       NRF_DRV_USBD_EPIN2

#define CDC_ACM_DATA_INTERFACE  1
#define CDC_ACM_DATA_EPIN       NRF_DRV_USBD_EPIN1
#define CDC_ACM_DATA_EPOUT      NRF_DRV_USBD_EPOUT1

APP_USBD_CDC_ACM_GLOBAL_DEF(m_app_cdc_acm,
		cdc_acm_user_ev_handler,
		CDC_ACM_COMM_INTERFACE,
		CDC_ACM_DATA_INTERFACE,
		CDC_ACM_COMM_EPIN,
		CDC_ACM_DATA_EPIN,
		CDC_ACM_DATA_EPOUT,
		APP_USBD_CDC_COMM_PROTOCOL_NONE
);

static void cdc_acm_user_ev_handler(app_usbd_class_inst_t const * p_inst, app_usbd_cdc_acm_user_event_t event) {
	switch (event) {
	case APP_USBD_CDC_ACM_USER_EVT_PORT_OPEN: {
//		nrf_gpio_pin_set(LED_PIN);
		// Setup first transfer
		char rx;
		app_usbd_cdc_acm_read(&m_app_cdc_acm, &rx, 1);
		break;
	}
	case APP_USBD_CDC_ACM_USER_EVT_PORT_CLOSE:
//		nrf_gpio_pin_clear(LED_PIN);
		break;
	case APP_USBD_CDC_ACM_USER_EVT_TX_DONE:
		break;
	case APP_USBD_CDC_ACM_USER_EVT_RX_DONE: {
		ret_code_t ret;
		char rx;

		do {
			ret = app_usbd_cdc_acm_read(&m_app_cdc_acm, &rx, 1);
		} while (ret == NRF_SUCCESS);
		break;
	}
	default:
		break;
	}
}

static void usbd_user_ev_handler(app_usbd_event_type_t event) {
	switch (event) {
	case APP_USBD_EVT_DRV_SUSPEND:
		break;
	case APP_USBD_EVT_DRV_RESUME:
		break;
	case APP_USBD_EVT_STARTED:
		break;
	case APP_USBD_EVT_STOPPED:
		app_usbd_disable();
		break;
	case APP_USBD_EVT_POWER_DETECTED:
		if (!nrf_drv_usbd_is_enabled()) {
			app_usbd_enable();
		}
		break;
	case APP_USBD_EVT_POWER_REMOVED:
		app_usbd_stop();
		break;
	case APP_USBD_EVT_POWER_READY:
		app_usbd_start();
		break;
	default:
		break;
	}
}
#endif

static void pm_evt_handler(pm_evt_t const * p_evt) {
	ret_code_t err_code;

	pm_handler_on_pm_evt(p_evt);
	pm_handler_disconnect_on_sec_failure(p_evt);
	pm_handler_flash_clean(p_evt);

