vedderb/nrf52_vesc/main.c
	if (m_reset_timer > 0) {
		m_reset_timer--;
		if (m_reset_timer == 0) {
			NVIC_SystemReset();
		}
	}

	CRITICAL_REGION_ENTER();
	if (m_other_comm_disable_time > 0) {
		m_other_comm_disable_time--;
	}
	CRITICAL_REGION_EXIT();
}

static void nrf_timer_handler(void *p_context) {
	(void)p_context;

#if USE_SLEEP
	// If BLE just disconnected this packet is sent at a higher rate for 10 seconds. The reason
	// is that the disconnect might have happened because the connected VESC or VESC BMS was
	// sleeping and didn't respond. This higher rate gives it a change to wake up on UART events
	// so that the next connect works.
	// TODO: Maybe this should be handled from VESC Tool by trying for longer?
	if (m_disconnect_cnt) {
		m_disconnect_cnt--;
		app_timer_start(m_nrf_timer, APP_TIMER_TICKS(100), NULL);
	} else {
		app_timer_start(m_nrf_timer, APP_TIMER_TICKS(1000), NULL);
	}
#else
	app_timer_start(m_nrf_timer, APP_TIMER_TICKS(1000), NULL);
#endif

	if (m_other_comm_disable_time == 0) {
		uint8_t buffer[2];
		buffer[0] = COMM_EXT_NRF_PRESENT;
		buffer[1] = 3; // Indicate name and pin code update is supported
		CRITICAL_REGION_ENTER();
		packet_send_packet(buffer, 2, PACKET_VESC);
		CRITICAL_REGION_EXIT();
	}

	cdc_printf("Test\r\n");

	// Reload watchdog
	NRF_WDT->RR[0] = WDT_RR_RR_Reload;
}

#if USE_SLEEP
static void go_to_sleep(void) {
	app_uart_close();
	app_timer_stop_all();
	esb_timeslot_sd_stop();

	nrf_gpio_cfg_default(LED_PIN);
	nrf_gpio_cfg_default(UART_RX);
	nrf_gpio_cfg_default(UART_TX);

#ifdef LED_PIN2_INV
	nrf_gpio_cfg_default(LED_PIN2_INV);
#endif

	// Workaround current consumption issue by power cycling the UART peripherals
	// https://devzone.nordicsemi.com/f/nordic-q-a/42883/current-consumption-when-using-timer-and-scheduler-alongwith-nrf_pwr_mgmt_run/167545#167545
	*(volatile uint32_t *)0x40002FFC = 0;   // Power down UARTE0
	*(volatile uint32_t *)0x40002FFC;       //
	*(volatile uint32_t *)0x40002FFC = 1;   // Power on UARTE0 so it is ready for next time

	*(volatile uint32_t *)0x40028FFC = 0;   // Power down UARTE1
	*(volatile uint32_t *)0x40028FFC;       //
	*(volatile uint32_t *)0x40028FFC = 1;   // Power on UARTE1 so it is ready for next time

#ifdef MODULE_RD_BMS
	nrf_gpio_pin_clear(NRF_GPIO_PIN_MAP(1, 1));
#endif

	if (nrf_sdh_is_enabled()) {
		nrf_sdh_disable_request();
		while (nrf_sdh_is_enabled()) {}
	}

	// The watchdog will wake up the CPU. Then we reset and start
	// advertising ble again.

	__set_FPSCR(__get_FPSCR()  & ~(0x0000009F));
	(void)__get_FPSCR();
	NVIC_ClearPendingIRQ(FPU_IRQn);

	__SEV();
	__WFE();
	__WFE();
	NVIC_SystemReset();
}
#endif

int main(void) {
	nrf_gpio_cfg_output(LED_PIN);

#ifdef LED_PIN2_INV
	nrf_gpio_cfg_output(LED_PIN2_INV);
#endif

#if MODULE_RD_BMS
	nrf_gpio_cfg_output(NRF_GPIO_PIN_MAP(1, 1));
	LED_ON();
	nrf_delay_ms(5);
	nrf_gpio_pin_clear(NRF_GPIO_PIN_MAP(1, 1));
	LED_OFF();
#endif

#if defined(NRF52840_XXAA) && USE_USB
	nrf_drv_clock_init();

	static const app_usbd_config_t usbd_config = {
			.ev_state_proc = usbd_user_ev_handler
	};

	app_usbd_serial_num_generate();
	app_usbd_init(&usbd_config);
	app_usbd_class_inst_t const * class_cdc_acm = app_usbd_cdc_acm_class_inst_get(&m_app_cdc_acm);
	app_usbd_class_append(class_cdc_acm);
#endif

	// Watchdog
	NRF_WDT->CONFIG = (WDT_CONFIG_HALT_Pause << WDT_CONFIG_HALT_Pos) | ( WDT_CONFIG_SLEEP_Run << WDT_CONFIG_SLEEP_Pos);
	NRF_WDT->CRV = 5 * 32768; // 5s timout
	NRF_WDT->RREN |= WDT_RREN_RR0_Msk;
	NRF_WDT->TASKS_START = 1;

	storage_init();
	uart_init();
	app_timer_init();
	nrf_pwr_mgmt_init();
	ble_stack_init();
	gap_params_init();
	gatt_init();
	services_init();
	advertising_init();
	conn_params_init();

	if (m_config.pin_set) {
		peer_manager_init();
	}

	(void)set_enabled;

	packet_init(uart_send_buffer, process_packet_vesc, PACKET_VESC);
	packet_init(ble_send_buffer, process_packet_ble, PACKET_BLE);

	app_timer_create(&m_packet_timer, APP_TIMER_MODE_REPEATED, packet_timer_handler);
	app_timer_start(m_packet_timer, APP_TIMER_TICKS(1), NULL);

	app_timer_create(&m_nrf_timer, APP_TIMER_MODE_SINGLE_SHOT, nrf_timer_handler);
	app_timer_start(m_nrf_timer, APP_TIMER_TICKS(1200), NULL);

	esb_timeslot_init(esb_timeslot_data_handler);
	esb_timeslot_sd_start();

#if defined(NRF52840_XXAA) && USE_USB
	app_usbd_power_events_enable();
#endif

	start_advertising();

	for (;;) {
#if defined(NRF52840_XXAA) && USE_USB
		while (app_usbd_event_queue_process()){}
#endif

		if (m_uart_error) {
			app_uart_close();
			uart_init();
			packet_reset(PACKET_VESC);
			m_uart_error = false;
		}

		uint8_t byte;
		while (app_uart_get(&byte) == NRF_SUCCESS) {
			packet_process_byte(byte, PACKET_VESC);
		}

		// https://devzone.nordicsemi.com/f/nordic-q-a/15243/high-power-consumption-when-using-fpu
		__set_FPSCR(__get_FPSCR()  & ~(0x0000009F));
		(void)__get_FPSCR();
		NVIC_ClearPendingIRQ(FPU_IRQn);
		
		if (m_config.pin_set) {
			nrf_ble_lesc_request_handler();
		}

		sd_app_evt_wait();

		// Reload watchdog
		NRF_WDT->RR[0] = WDT_RR_RR_Reload;
	}
}
